{
  "main": {
    "name": "Meet Savani",
    "description": "I am a Full stack Software Engineer and I use React.js, Node, MySQL and Flask or Sanic to develop web application.",
    "image": "profilepic.jpeg",
    "bio": "I love Web Development and I have a passion for creating intuitive and dynamic user experiences.",
    "contactmessage": "Get in touch with me.",
    "email": "savanimeet06@gmail.com",
    "phone": "+1-6573195502",
    "github": "https://github.com/meetsavani",
    "project": "https://github.com/meetsavani",
    "address": {
      "city": "Arlington",
      "state": "Texas",
      "zip": "76013"
    },
    "website": "https://www.meetsave.com",
    "resumedownload": "https://www.meetsave.com",
    "social": [
      {
        "name": "facebook",
        "url": "https://www.facebook.com/meet.savani.5",
        "className": "fa fa-facebook"
      },
      {
        "name": "twitter",
        "url": "https://twitter.com/savani__meet",
        "className": "fa fa-twitter"
      },
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/meet-savani-b98734178/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "github",
        "url": "https://github.com/meetsavani",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "I am skilled in developing Fornt-end Web applications",
    "education": [
      {
        "school": "University of Texas at Arlington",
        "degree": "Masters of Science in Computer Science",
        "graduated": "December 2023"
      },
      {
        "school": "Maharaja Sayajirao University of Vadodara",
        "degree": "Bachelors of Engineering in Computer Science and Engineering",
        "graduated": "April 2020"
      }
    ],
    "work": [
      {
        "company": "Electrum It Solutions Pvt. Ltd.",
        "title": "Software Engineer",
        "years": "Jan. 2021 - Oct. 2021",
        "description": [
          "Orchestrated the delivery of four cutting-edge Progressive Web Applications (PWAs) for web and mobile, harnessing technologies such as ReactJS, Angular, ExpressJS, Python, and PHP, meeting diverse client demands.",
          "Designed fully responsive, interactive, and user-friendly interfaces, driving a remarkable 25% increase in user engagement and overall satisfaction.",
          "Achieved a 100% on-time delivery rate, consistently delivering projects within defined timelines and budgets, garnering client accolades for exceeding expectations.",
          "Fostered seamless collaboration across cross-functional teams, including design, clients, and senior management, nurturing robust professional relationships and ensuring project success.",
          "Spearheaded the development of five compelling demo projects and proof of concept initiatives, playing a pivotal role in elevating company growth and market presence."
        ]
      },
      {
        "company": "VINROX Technologies LLP",
        "title": "Software Engineer",
        "years": "Jun. 2020 - Jan. 2021",
        "description": [
          "Led the development of cutting-edge web applications using React, Node.js, and MongoDB, achieving high-performance outcomes and introducing innovative features.",
          "Seamlessly integrated seven third-party APIs for payment gateways and shipping services, bolstered by stringent security measures to safeguard user data.",
          "Strategically optimized website performance based on data-driven insights, resulting in a remarkable 20% increase in user engagement.",
          "Collaborated closely with cross-functional teams to successfully launch three complex projects, emphasizing user-centric design principles and delivering high-quality code."
        ]
      },
      {
        "company": "VINROX Technologies LLP",
        "title": "Software Engineer Intern",
        "years": "May. 2019 - Jun. 2020",
        "description": [
          "Collaborated effectively in the construction of eight dynamic web applications, utilizing React, Node.js, and MongoDB, gaining hands-on experience throughout the software development lifecycle.",
          "Integrated nine third-party APIs with rigorous security measures to ensure the integrity of user data.",
          "Enhanced teamwork and communication skills through active coordination with developers, designers, and project managers across multiple projects.",
          "Elevated client interaction skills, providing project updates and insights while refining the ability to communicate technical details effectively to non-technical stakeholders during participation in technical workshops and seminars."
        ]
      }
    ],
    "skills": [
      {
        "name": "Python",
        "level": "80%"
      },
      {
        "name": "ReactJs",
        "level": "90%"
      },
      {
        "name": "CSS",
        "level": "90%"
      },
      {
        "name": "Ionic",
        "level": "60%"
      },
      {
        "name": "Sanic",
        "level": "70%"
      },
      {
        "name": "Flask",
        "level": "80%"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title":"Callation",
        "url":"https://www.callation.com.au/"
      },
      {
        "title":"Callation Reseller",
        "url":"https://reseller.callation.com.au/login"
      },
      {
        "title":"Virtual Guide",
        "url":"https://e-virtual-guide.netlify.app/login"
      },
      {
        "title":"Pagebuzz",
        "url":"https://pagebuzz.in/"
      }
    ]
  }
}