{
  "main": {
    "name": "Meet Savani",
    "description": "I am a Full stack Software Engineer and I use React.js, Node, MySQL, Python, Django, Flask and PHP to develop applications.",
    "image": "profilepic.jpeg",
    "bio": "Highly motivated software engineering professional with experience in developing, deploying, and maintaining web, mobile, and desktop applications. Skilled in utilizing various technologies such as Python, JavaScript, HTML, CSS, and SQL. Experienced in working in team-oriented software development projects and agile development methodologies. Excited about developing innovative and efficient software solutions that meet customer needs.",
    "contactmessage": "Get in touch with me.",
    "email": "savanimeet06@gmail.com",
    "phone": "+1-6573195502",
    "github": "https://github.com/meetsavani",
    "project": "https://github.com/meetsavani",
    "address": {
      "city": "Los Angeles",
      "state": "California",
      "zip": "90701"
    },
    "website": "https://www.meetsave.com",
    "resumedownload": "https://www.meetsave.com",
    "social": [
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com",
        "className": "fa fa-linkedin"
      },
      {
        "name": "github",
        "url": "https://github.com/meetsavani",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "I am skilled in developing Full Stack applications",
    "education": [
      {
        "school": "University of Texas at Arlington",
        "degree": "Masters of Science in Computer Science",
        "graduated": "December 2023"
      },
      {
        "school": "Maharaja Sayajirao University of Vadodara",
        "degree": "Bachelors of Engineering in Computer Science and Engineering",
        "graduated": "April 2020"
      }
    ],
    "work": [
      {
        "company": "Electrum It Solutions Pvt. Ltd.",
        "title": "Software Engineer (Full Stack Developer)",
        "years": "Jan. 2021 - Dec. 2021",
        "description": [
         "Utilized modern front-end technologies like HTML5, CSS3, and JavaScript frameworks (React, Vue.js, Angular) to create interactive and visually appealing front-end web applications for seamless experiences across devices.",
         "Leveraged Node.js, Express, and Django to architect robust back-end applications resulting in a 30% improvement in application performance and scalability.",
         "Designed and optimized database schemas using MongoDB, PostgreSQL, and Redis leading to a 40% reduction in database query times. Implemented data caching strategies for improved application speed and efficiency.",
         "Implemented OAuth, JWT, and secure encryption techniques to fortify user authentication and data protection.",
         "Automated deployment pipelines using Jenkins and GitLab for CI/CD. Managed infrastructure on AWS and utilized Terraform for infrastructure as code.",
         "Actively participated in Agile ceremonies, utilizing Scrum and Kanban methodologies. Collaborated closely with cross-functional teams to deliver high-quality products within strict timelines."        ]
      },
      {
        "company": "VINROX Technologies LLP",
        "title": "Software Engineer (Full Stack Developer)",
        "years": "Jun. 2018 - Jan. 2021",
        "description": [
         "Spearheaded the creation of dynamic web applications using React.js, Angular, and Django (Python) for the front end and back end. Leveraged GraphQL for optimized data handling, resulting in a notable 40% performance enhancement.",
         "Implemented microservices architecture utilizing Node.js, Express.js, and a mix of MongoDB and PostgreSQL, bolstering system scalability and performance.",
         "Developed RESTful APIs using Flask and Ruby on Rails, handling authentication, data processing, and integration with various third-party services reducing API response times by 20%.",
         "Orchestrated the migration of legacy systems to cloud-native architectures, deploying on AWS with Docker containers and Kubernetes, reducing deployment time by 50% and streamlining orchestration.",
         "Executed technical optimizations, integrating Redis caching for database performance enhancement, reducing response times by 30%, and improving system responsiveness.",
         "Engineered AI-driven features using TensorFlow.js, elevating user experiences and adding advanced functionalities to applications.",
         "Led the development of hybrid mobile applications using Ionic and React Native, delivering seamless experiences on iOS and Android platforms.",
         "Architected a real-time analytics dashboard, leveraging WebSockets and D3.js, providing clients with actionable insights, resulting in a 25% increase in user engagement."
        ]
      },
      {
        "company": "VINROX Technologies LLP",
        "title": "Software Engineer Intern",
        "years": "Jan. 2018 - Jun. 2018",
        "description": [
          "Assisted in the development of responsive user interfaces using HTML, CSS, and JavaScript frameworks such as jQuery. Collaborated with the design team to implement UI/UX enhancements.",
          "Contributed to server-side scripting using PHP resulting in improved database query times by 15% and streamlined data processing."
        ]
      }
    ],
    "skills": [
      {
        "name": "Python",
        "level": "90%"
      },
      {
        "name": "Javascript",
        "level": "90%"
      },
      {
        "name": "ReactJs",
        "level": "90%"
      },
      {
        "name": "CSS",
        "level": "90%"
      },
      {
        "name": "AWS",
        "level": "70%"
      },
      {
        "name": "MongoDB",
        "level": "80%"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title":"Callation",
        "url":"https://www.callation.com.au/"
      },
      {
        "title":"Callation Reseller",
        "url":"https://reseller.callation.com.au/login"
      },
      {
        "title":"Virtual Guide",
        "url":"https://e-virtual-guide.netlify.app/login"
      },
      {
        "title":"Pagebuzz",
        "url":"https://pagebuzz.in/"
      },
      {
        "title":"Demo Hydrogen App",
        "url":"https://meetsavani.netlify.app/"
      }
    ]
  }
}
